app/controllers/api/v1/groceries_controller.rb

SELECT `grocery_items`.* FROM `grocery_items` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `grocery_items`
---
      def index
        @groceries = GroceryItem.page(params[:page]).per(5)

INSERT INTO `grocery_items` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('Eggs', 2, '2025-07-24 06:08:40.797134', '2025-07-24 06:08:40.797134')
---
      def create
        @grocery = GroceryItem.new(grocery_params)
        @grocery.user = current_user
        @grocery.tenant_id=Current.tenant_id

        if @grocery.save

SELECT `grocery_items`.* FROM `grocery_items` WHERE `grocery_items`.`id` = 1 LIMIT 1
---
      def set_grocery
        @grocery = GroceryItem.find(params[:id])