app/controllers/api/v1/pantry_items_controller.rb

SELECT `pantry_items`.* FROM `pantry_items` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `pantry_items`
---
      def index
        @pantry_items = PantryItem.page(params[:page]).per(5)

INSERT INTO `pantry_items` (`name`, `quantity`, `user_id`, `created_at`, `updated_at`) VALUES ('Rice', '5', 2, '2025-07-24 06:18:11.079898', '2025-07-24 06:18:11.079898')
---
      def create
        @pantry_item = PantryItem.new(pantry_item_params)
        @pantry_item.user = current_user
        @pantry_item.tenant_id= Current.tenant_id

        if @pantry_item.save

UPDATE `pantry_items` SET `pantry_items`.`quantity` = '10', `pantry_items`.`updated_at` = '2025-07-24 06:19:06.181362' WHERE `pantry_items`.`id` = 1
---
      def update
        if @pantry_item.update(pantry_item_params)

DELETE FROM `pantry_items` WHERE `pantry_items`.`id` = 1
---
      def destroy
        if @pantry_item.destroy

SELECT `pantry_items`.* FROM `pantry_items` WHERE `pantry_items`.`id` = 1 LIMIT 1
---
      def set_pantry_item
        @pantry_item = PantryItem.find(params[:id])