app/controllers/api/v1/recipes_controller.rb

      def index
        @recipes = Recipe.page(params[:page]).per(5)
---
SELECT `recipes`.* FROM `recipes` LIMIT 5 OFFSET 5
SELECT COUNT(*) FROM `recipes`

      def destroy
        @recipe.destroy
---
DELETE FROM `recipes` WHERE `recipes`.`id` = 1

      def set_recipe
        @recipe = Recipe.find(params[:id])
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1